tests/auto_build/testcases/output/AttDataHandlerTextRequest.out

POST /DataHandlerService/services/DataHandlerService HTTP/1.1
Host: localhost:13260
SOAPAction: ""
Content-Type: multipart/related; type="text/xml"; boundary="------=MIME_BOUNDARY"; start="<2>"
Content-Length: 775


--------=MIME_BOUNDARY
Content-Type: text/xml; charset=UTF-8
Content-Transfer-Encoding: binary
Content-Id: <2>

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:echoContent xmlns:ns1="http://datahandler.attachment.test.org">
<ns1:arg_0_2 href="cid:1"
   xsi:type="ns2:DataHandler"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
</ns1:echoContent>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>


--------=MIME_BOUNDARY
Content-Id: <1>
Content-Type: text/plain
Content-Transfer-Encoding: base64

VGhpcyBpcyBhIHRlc3QgbWVzc2FnZSBmb3IgYXR0YWNobWVudA==

--------=MIME_BOUNDARY--
POST /DataHandlerService/services/DataHandlerService HTTP/1.1
Host: localhost:13260
SOAPAction: ""
Content-Length: 781
Content-Type: multipart/related; type="text/xml"; boundary="------=MIME_BOUNDARY"; start="<3>"


--------=MIME_BOUNDARY
Content-Type: text/xml; charset=UTF-8
Content-Transfer-Encoding: binary
Content-Id: <3>

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:getContentType xmlns:ns1="http://datahandler.attachment.test.org">
<ns1:arg_0_0 href="cid:1"
   xsi:type="ns2:DataHandler"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
</ns1:getContentType>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>


--------=MIME_BOUNDARY
Content-Id: <1>
Content-Type: text/plain
Content-Transfer-Encoding: base64

VGhpcyBpcyBhIHRlc3QgbWVzc2FnZSBmb3IgYXR0YWNobWVudA==

--------=MIME_BOUNDARY--
